---
kind: enumMember
id: F:Autodesk.Revit.DB.TextNoteLeaderTypes.TNLT_STRAIGHT_R
enum: Autodesk.Revit.DB.TextNoteLeaderTypes
source: html/79bbfd8e-1226-602b-0355-3a20c6ef3d89.htm
---
# Autodesk.Revit.DB.TextNoteLeaderTypes.TNLT_STRAIGHT_R

A line leader attached from the right side of a text element